Repository: chabulhwi/lean-notes
Catalog: docs/omegat/project_save.tmx
Source language: en
Languages: ko

source: #theorem-anselmnot_exists_int_isgod
ko: #정리-anselmnot_exists_int_isgod

source: (Depiction.isObscene_of_isPorn)
ko: [Depiction.isObscene_of_isPorn, 이 전제는 영문으로 번역된 아청법 조항을 분석하는 데 필요함]

source: (Depiction.isPorn_of_isCYP)
ko: (Depiction.isObscene_of_isCYP)

source: (Modified premise)
ko: (**수정된** 전제)

source: (Assumption for reductio)
ko: (**귀류법**을 위한 가정)

source: (From (1) and (2).)
ko: [(1)과 (2)에 따름]

source: (From (1), (5), (6).)
ko: [(1), (5), (6)에 따름]

source: (From (3) and (4).)
ko: [(3)과 (4)에 따름]

source: (From (7), (8).)
ko: [(7), (8)에 따름]

source: (From the definition of “God”.)
ko: ('신'의 정의에 따름)

source: (Premise)
ko: (전제)

source: (Premise, to which even the Fool agrees.)
ko: (어리석은 이도 동의하는 전제)

source: (See 9.1 Formulation 1 of the SEP entry "Ontological Arguments.")
ko: (스탠퍼드 철학 백과사전의 '존재론적 논증' 항목의 9.1 정식화 1을 보십시오.)

source: (See plantinga Formulation 1 of the SEP entry "Ontological Arguments.")
ko: (스탠퍼드 철학 백과사전의 '존재론적 논증' 항목의 9.1 정식화 1을 보십시오.)

source: 16, 2024) defines child or youth sexual exploitation materials (CYSEM) as follows:
ko: 2024년 10월 16일 시행)에서, '아동·청소년 성 착취물'은 다음과 같이 정의됩니다.

source: 18, 2012; Jan.
ko: \<개정 2012. 12. 18.,

source: Anselm: St. Anselm's ontological argument for the existence of God.
ko: Anselm: 신의 존재에 대한, 안셀무스의 존재론적 논증.

source: CYSEM: Redefining child or youth sexual exploitation material (CYSEM)
ko: CYSEM: 아동·청소년 성 착취물 재정의하기

source: CategoryMistake: An example of category mistakes.
ko: CategoryMistake: 범주 실수의 예.

source: GoodSmelling x: x smells good, where x is a drink that has a smell.
ko: GoodSmelling x: x는 냄새가 좋다. 이때 x는 냄새가 나는 음료이다.

source: HasSmell x: x has a smell.
ko: HasSmell x: x는 냄새가 난다.

source: IsGod.inUnderstanding {x : Being} : IsGod x → InUnderstanding x (Step 8)
ko: IsGod.inUnderstanding {x : Being} : IsGod x → InUnderstanding x (8단계)

source: exists_conceivable_and_inReality : ∃ (x : Being), Conceivable x ∧ InReality x (Step 3)
ko: exists_conceivable_and_inReality : ∃ (x : Being), Conceivable x ∧ InReality x (3단계)

source: goodSmelling_eq_none_of_not_hasSmell x: If x is a drink that has no smell, GoodSmelling x is none, which means that this class doesn't have the proposition "x smells good."
ko: goodSmelling_eq_none_of_not_hasSmell x: x가 냄새가 안 나는 음료일 때, GoodSmelling x는 none이다. 이는 유형 클래스 `GoodSmellingDrink`에 "x는 냄새가 좋다."라는 명제가 없다는 뜻이다.

source: lt_of_inUnderstanding_not_inReality_inReality {x y : Being} : InUnderstanding x → ¬ InReality x → InReality y → x < y (Step 2)
ko: lt_of_inUnderstanding_not_inReality_inReality {x y : Being} : InUnderstanding x → ¬ InReality x → InReality y → x < y (2단계)

source: lt_of_inUnderstanding_not_inReality_inReality {x y : Being} : InUnderstanding x → ¬InReality x → InReality y → x < y (Step 2)
ko: lt_of_inUnderstanding_not_inReality_inReality {x y : Being} : InUnderstanding x → ¬InReality x → InReality y → x < y (2단계)

source: A being that exists in reality and can be conceived is greater than God.
ko: 현실에 존재하고 생각될 수 있는 존재자는 신보다 크다.

source: A class of drinks with two predicates, HasSmell and GoodSmelling, defined as follows:
ko: 다음과 같이 정의된 두 술어 HasSmell and GoodSmelling가 있는 음료의 클래스.

source: A user named car_nap pointed out (in Korean) that I didn't prove that the statement ∃ (x : Being), IsGod x ∧ InReality x is not a theorem of a theory whose axioms are the premises of St. Anselm's argument (and the axioms of Lean's type theory).
ko: ∃ (x : Being), IsGod x ∧ InReality x라는 진술은, 안셀무스가 제시한 논증의 전제(그리고 린의 유형론의 공리)로 공리계가 이뤄진 이론의 정리가 아님을 저는 증명하지 않았습니다. 카르납(car_nap)이라는 이용자가 이 점을 지적했습니다.

source: A user named car_nap pointed out that I didn't prove that the statement ∃ (x : Being), IsGod x ∧ InReality x is not a theorem of a theory whose axioms are the premises of St. Anselm's argument (and the axioms of Lean's type theory).
ko: ∃ (x : Being), IsGod x ∧ InReality x라는 진술은 안셀무스의 논증에 있는 전제(그리고 린의 유형론의 공리)가 공리인 이론의 정리가 아님을 저는 증명하지 않았습니다. 카르납(car_nap)이라는 이용자가 이 점을 지적했습니다.

source: A user named car_nap of Owl of Sogang, a Korean-speaking philosophy discussion forum, pointed out (in Korean) that I didn't prove that the statement ∃ (x : Being), IsGod x ∧ InReality x is not a theorem of a theory whose axioms are the premises of St. Anselm's argument (and the axioms of Lean's type theory).
ko: ∃ (x : Being), IsGod x ∧ InReality x라는 진술은, 안셀무스가 제시한 논증의 전제(그리고 린의 유형론의 공리)로 공리계가 이뤄진 이론의 정리가 아님을 제가 증명하지 않았다는 지적을 받았습니다. 이 지적은 한국의 철학 포럼인 서강올빼미의 한 이용자 카르납(car_nap) 님이 했습니다.

source: Acknowledgements
ko: 감사의 말

source: Act No. 20462, Oct.
ko: 2024. 10. 16. 시행. 법률 제20462호,

source: Act On the Protection of Children and Youth Against Sex Offenses
ko: 아동·청소년의 성보호에 관한 법률

source: Act On the Protection of Children and Youth Against Sex Offenses.
ko: 아동·청소년의 성보호에 관한 법률.

source: Alistair Tucker also told me how to prove that we can't deduce the statement ∃ (x : Being), IsGod x ∧ InReality x from the premises of St. Anselm's argument and the axioms of Lean's type theory.
ko: 안셀무스가 제시한 논증의 전제와 린의 유형론의 공리에서 ∃ (x : Being), IsGod x ∧ InReality x라는 진술을 도출할 수 없음을 증명하는 방법은 앨리스터 터커 님이 제게 알려 줬습니다.

source: Alistair Tucker commented on transcribing premise 3 of the original formulation by Alvin Plantinga.
ko: 앨리스터 터커 님은 앨빈 플랜팅가가 정식화한 원래 논증의 3단계를 린으로 옮길 방법을 논했습니다.

source: Alistair Tucker gave a comment on transcribing premise 3 of the original formulation by Alvin Plantinga.
ko: 앨리스터 터커 님은 앨빈 플랜팅아가 정식화한 원래 논증의 3단계를 린으로 옮길 방법을 논했습니다.

source: An example of category mistakes: good-smelling drinks
ko: 범주 실수의 예: 냄새 좋은 음료

source: Apart from the changes to subparagraph 4 of Article 2, the current definition of CYSEM is logically equivalent to my definition, where it is defined as (a) real CYSEM or (b) virtual CYSEM that lacks any value.
ko: 제2조 제4호의 변경 사항을 제외하면, 현행 아청법에 따른 아동·청소년 성 착취물의 정의는 차불휘가 제안한 정의와 논리적으로 동등하다. 그 정의에 따르면, 아동·청소년 성 착취물은 (1) 실제 아동·청소년 성 착취물 또는 (2) 하등의 가치를 지니지 않는 가상 아동·청소년 성 착취물을 일컫는다.

source: Are the proposition "Water smells good." and its negation both false since water has no smell?
ko: 물은 냄새가 나지 않으므로 "물은 냄새가 좋다."라는 명제와 그 부정은 모두 거짓일까요?

source: Article 2 (Definitions) The terms used in this Act are defined as follows: \<Amended on Dec.
ko: 제2조(정의) 이 법에서 사용하는 용어의 뜻은 다음과 같다.

source: Below are some important premises and lemmas.
ko: 몇 가지 중요한 전제와 보조 정리를 아래에 나열했습니다.

source: Below are some important premises of my arguments.
ko: 제 논증의 몇 가지 중요한 전제들을 아래에 나열했습니다.

source: Below are the items of subparagraph 4:
ko: 제4호의 각 목은 다음과 같습니다.

source: CYP is pornography.
ko: 아동·청소년 이용 음란물은 포르노그래피이다.

source: CYSEM is equivalent to CYP.
ko: 아동·청소년 성 착취물은 아동·청소년 이용 음란물과 동등하다.

source: CYSEM is equivalent to child or youth pornography (CYP).
ko: 아동·청소년 성 착취물은 아동·청소년 이용 음란물과 동등하다.

source: Child or youth pornography (CYP) is pornography.
ko: 아동·청소년 이용 음란물은 음란하다.

source: Directories
ko: 디렉터리

source: Documentation: docs
ko: 문서: docs

source: English | 한국어[Korean]
ko: [English (영어)](./README.md) | 한국어

source: English: en
ko: 영어: en

source: Eric Wieser found inconsistency in my first and second drafts.
ko: 에릭 위저 님은 제 초고와 둘째 원고의 모순성을 찾아냈습니다.

source: Every obscene material lacks any value.
ko: 모든 음란물은 하등의 가치를 지니지 않는다.

source: Example
ko: 보기

source: Existence in reality is greater than existence in the understanding alone.
ko: 현실에 존재함이 지성에만 존재함보다 크다.

source: For this reason, I think St. Anselm's argument doesn't show God's existence.
ko: 이런 이유로, 저는 안셀무스의 논증이 신의 존재를 보이지 않는다고 생각합니다.

source: God exists in the understanding but not in reality.
ko: 신은 지성에 존재하지만, 현실에는 존재하지 않는다.

source: God exists in the understanding.
ko: 신은 지성에 존재한다.

source: Good-smelling drinks
ko: 냄새 좋은 음료

source: Hence God exists in reality.
ko: 그러므로 신은 현실에 존재한다.

source: Hence, it is false that God exists in the understanding but not in reality.
ko: 그러므로 신이 지성에는 존재하지만 현실에는 존재하지 않는다는 것은 거짓이다.

source: However, CYSEM using cartoon characters still doesn't include printed matter.
ko: 그러나 만화 캐릭터만 이용해 만든 아동·청소년 성 착취물의 범주에는 여전히 인쇄물이 안 들어감.

source: I also formally stated my conjecture about a visual depiction of a real child or youth doing a sexual act: all of them are obscene.
ko: 실제 아동·청소년의 성적 행위를 시각적으로 묘사한 표현물에 관한 제 추측도 형식화했습니다. 그 추측의 내용은 다음과 같습니다. "그런 표현물은 모두 음란하다."

source: I clarified that CYSEM doesn't include written text.
ko: 텍스트는 아동·청소년 성 착취물의 범주에 들어가지 않음을 명시함.

source: I explicitly stated that CYSEM that uses fictional characters lacks serious literary, artistic, ideological, scientific, medical, or educational value.
ko: 가상의 캐릭터만 이용해 만든 아동·청소년 성 착취물은 하등의 문학적·예술적·사상적·과학적·의학적·교육적 가치를 지니지 않음을 명시적으로 서술함.

source: I formalized the three premises of the argument as follows:
ko: 논증의 세 전제는 다음과 같이 형식화했습니다.

source: I included printed media in CYSEM that uses real children or youth.
ko: 실제 아동·청소년 성 착취물의 범주에만 인쇄물을 넣음.

source: I made three changes to subparagraph 5 of Article 2:
ko: 그 글에서, 저는 제2조 제5호를 다음과 같이 개정했습니다.

source: I suggested three changes to subparagraph 5 of Article 2:
ko: 그 글에서, 저는 제2조 제5호를 다음과 같이 개정할 것을 제안했습니다.

source: I think the conclusion of St. Anselm's argument is the following statement:
ko: 제가 보건대, 안셀무스가 제시한 논증의 결론은 다음 진술과 같습니다.

source: I think the sentence "Water smells good." is a category mistake.
ko: 제가 보건대, "물은 냄새가 좋다."라는 문장은 범주 실수입니다.

source: I think we can only conclude from St. Anselm's argument that the following statement is true:
ko: 제가 보건대, 안셀무스의 논증에서 이끌어 낼 수 있는 결론은 다음 진술이 참이라는 것뿐입니다.

source: I use OmegaT to translate English documentation into Korean.
ko: 오메가T(OmegaT)를 이용해 영어 문서를 한국어로 번역했습니다.

source: I used the type Option Prop to define the predicate GoodSmelling on drinks.
ko: 저는 유형 Option Prop을 이용해, 음료에 대한 술어 GoodSmelling을 정의했습니다.

source: I want to thank car_nap for raising the issue mentioned above.
ko: 위에서 언급한 문제를 제기한 카르납 님에게 감사합니다.

source: I wrote a document (Korean) about how to revise the definition of child or youth sexual exploitation material (CYSEM).
ko: 아동·청소년 성 착취물의 정의를 어떻게 고칠지에 관한 문서를 제가 작성했습니다.

source: I'd like to thank Eric Wieser and Alistair Tucker.
ko: 에릭 위저 님과 앨리스터 터커 님에게 감사의 말씀을 드리고 싶습니다.

source: If x is a drink that has no smell, GoodSmelling x is none, which means that you don't have the proposition "x smells good." in the type class GoodSmellingDrink.
ko: x 가 냄새가 안 나는 음료이면, GoodSmelling x는 none입니다. 이는 유형 클래스 GoodSmellingDrink에 "x는 냄새가 좋다."라는 명제가 없다는 뜻입니다.

source: If x is a drink that has no smell, GoodSmelling x is none, which means that you don't have the proposition "x smells good." in the type class I defined below.
ko: x 가 냄새가 안 나는 음료이면, GoodSmelling x는 none입니다. 이는 제가 아래에서 정의한 유형 클래스에 "x는 냄새가 좋다."라는 명제가 없다는 뜻입니다.

source: If so, we could easily derive a contradiction from these propositions.
ko: 만약 그렇다면, 이 명제들에서 모순을 쉽게 이끌어 낼 수 있습니다.

source: Important lemmas
ko: 중요한 보조 정리

source: Important premises
ko: 중요한 전제

source: Important premises and lemmas
ko: 중요한 전제와 보조 정리

source: In order to prove the existence of God in reality, you need to show that ∃ (x : Being), IsGod x ∧ InReality x.
ko: 신이 현실에 존재함을 증명하려면, ∃ (x : Being), IsGod x ∧ InReality x임을 보여야 합니다.

source: In the CYSEM file, I used the Lean theorem prover to formalize the following assertions:
ko: CYSEM 파일에서, 저는 린 정리 증명기를 이용해 다음 주장을 형식화했습니다.

source: In the CategoryMistake file, I used the type Option Prop to define the predicate GoodSmelling on drinks.
ko: CategoryMistake 파일에서, 저는 유형 Option Prop을 이용해, 음료에 대한 술어 GoodSmelling을 정의했습니다.

source: It merely says that if a being is God, it exists in reality.
ko: 어느 한 존재자가 신이면 그 존재자는 현실에 존재한다는 얘기만 할 뿐입니다.

source: It's a modified version of the formulation of St. Anselm's ontological argument by Alvin Plantinga.
ko: 이 파일은 앨빈 플랜팅아가 정식화한 안셀무스의 존재론적 논증을 수정한 버전입니다.

source: Korean: ko
ko: 한국어: ko

source: Lean code: Notes
ko: 린 코드: Notes

source: Let's define an inductive type called BulhwiDrink.
ko: BulhwiDrink라는 귀납형을 정의해 보겠습니다.

source: Limeade and almond milk smell good; durian smoothie doesn't.
ko: 라이메이드와 아몬드 우유는 냄새가 좋지만, 두리안 스무디는 그렇지 않다.

source: No being greater than God can be conceived.
ko: 신보다 큰 어떤 존재자도 생각될 수 없다.

source: Of course, I might have formalized it wrong.
ko: 물론 제가 안셀무스의 논증을 잘못 형식화했을 수 있습니다.

source: Owl of Sogang
ko: 서강올빼미

source: Owl of Sogang (서강올빼미)
ko: 서강올빼미

source: Pornography is obscene.
ko: 포르노그래피는 음란하다.

source: Redefining CYSEM
ko: 아동·청소년 성 착취물 재정의하기

source: Redefining child or youth sexual exploitation material (CYSEM)
ko: 아동·청소년 성 착취물 재정의하기

source: Reference
ko: 참고 문헌

source: References
ko: 참고 문헌

source: Since God is the greatest being that can be conceived, God itself can be conceived.
ko: 신은 생각될 수 있는 가장 큰 존재자이므로, 신 그 자체는 생각될 수 있습니다.

source: So I proved a theorem named Anselm.not_exists_int_isGod, which shows that there exist a universe level u, a type Being : Type u, and an instance of Anselm Being where the statement ∃ (x : Being), IsGod x is false.
ko: 그래서 Anselm.not_exists_int_isGod이라는 정리를 증명했습니다. 이 정리는 ∃ (x : Being), IsGod x이라는 진술이 거짓인 유형 세계 단계 u, 유형 Being : Type u 그리고 Anselm Being의 사례[인스턴스]가 존재함을 보여 줍니다.

source: So I proved a theorem named Anselm.not_exists_int_isGod, which states that there exist a universe level u, a type Being : Type u, and an instance of Anselm Being where the statement ∃ (x : Being), IsGod x is false.
ko: 그래서 Anselm.not_exists_int_isGod이라는 정리를 증명했습니다. 이 정리는 ∃ (x : Being), IsGod x이라는 진술이 거짓인 유형 세계 단계 u, 유형 Being : Type u 그리고 Anselm Being의 사례[인스턴스]가 존재한다는 내용입니다.

source: So I proved a theorem named not_exists_int_isGod, which shows that there exist a universe level u, a type Being : Type u, and an instance of Anselm Being where the statement ∃ (x : Being), IsGod x is false.
ko: 그래서 not_exists_int_isGod이라는 정리를 증명했습니다. 이 정리는 ∃ (x : Being), IsGod x이라는 진술이 거짓인 유형 세계 단계 u, 유형 Being : Type u 그리고 Anselm Being의 사례[인스턴스]가 존재함을 보여 줍니다.

source: St. Anselm's ontological argument
ko: 안셀무스의 존재론적 논증

source: Step 3 of the original formulation by Alvin Plantinga is the following premise: "A being having all of God’s properties plus existence in reality can be conceived." This premise is redundant.
ko: 앨빈 플랜팅가가 정식화한 원래 논증의 3단계는 다음 전제입니다. "신의 모든 속성을 갖고 현실에 존재하는 존재자는 생각될 수 있다." 이 전제는 불필요합니다.

source: The Anselm file might be the first second attempt in the Lean community to formalize an ontological argument for the existence of God in Lean.
ko: Anselm 파일이 아마 린 커뮤니티에서 신의 존재에 대한 존재론적 논증을 형식화하려는 첫 번째 두 번째 시도인 듯합니다.

source: The Anselm file might be the first attempt in the Lean community to formalize an ontological argument for the existence of God in Lean.
ko: Anselm 파일이 아마 린 커뮤니티에서 신의 존재에 대한 존재론적 논증을 형식화하려는 첫 시도인 듯합니다.

source: The Lean community
ko: 린 커뮤니티

source: The OmegaT project is in the docs directory.
ko: 오메가T 프로젝트는 docs 디렉터리에 있습니다.

source: The current South Korean Act On the Protection of Children and Youth Against Sex Offenses (Act No. 20462, Oct.
ko: '아동·청소년의 성보호에 관한 법률'(법률 제20462호,

source: The term "child or youth sexual exploitation materials" means depiction of children or youth, or persons or representations that can be obviously perceived as children or youth, doing any act defined in any item of subparagraph 4 or engaging in any other sexual act, in the form of a film, video, game software, or picture, image, etc. displayed on computers, or other communications media;
ko: “아동·청소년성착취물”이란 아동·청소년 또는 아동·청소년으로 명백하게 인식될 수 있는 사람이나 표현물이 등장하여 제4호 각 목의 어느 하나에 해당하는 행위를 하거나 그 밖의 성적 행위를 하는 내용을 표현하는 것으로서 필름·비디오물·게임물 또는 컴퓨터나 그 밖의 통신매체를 통한 화상·영상 등의 형태로 된 것을 말한다.

source: The term "children or youth" means persons under 19 years of age;
ko: “아동·청소년”이란 19세 미만의 사람을 말한다.

source: The type class GoodSmellingDrink
ko: 유형 클래스 GoodSmellingDrink

source: The type class GoodSmellingDrink of drinks has two predicates, HasSmell and GoodSmelling, defined as follows:
ko: 음료의 유형 클래스 GoodSmellingDrink에는 다음과 같이 정의된 두 술어 HasSmell와 GoodSmelling이 있습니다.

source: Theorem Anselm.not_exists_int_isGod
ko: 정리 Anselm.not_exists_int_isGod

source: Theorem not_exists_int_isGod
ko: 정리 not_exists_int_isGod

source: There exists a being in reality that can be conceived.
ko: 생각될 수 있는 존재자가 현실에 존재한다.

source: There exists a being that can be conceived and is greater than God.
ko: 생각될 수 있고 신보다 큰 존재자가 존재한다.

source: Therefore, a being having all of God's properties can be conceived.
ko: 따라서 신의 모든 속성을 갖는 존재자는 생각될 수 있습니다.

source: This class instance doesn't have the proposition "Water smells good."
ko: 이 유형 클래스 사례에는 "물은 냄새가 좋다."라는 명제가 없다.

source: This is a collection of my short Lean code for reference.
ko: 제가 참고용으로 작성한 짧은 린 코드를 이 저장소에 모아 놨습니다.

source: This theorem doesn't state that God exists in reality.
ko: 이 정리는 신이 현실에 존재한다고 진술하지 않습니다.

source: This type has four constructors: Water, Limeade, AlmondMilk, and DurianSmoothie.
ko: 이 유형에는 구성자가 네 개 있습니다. 물(Water), 라이메이드(Limeade), 아몬드 우유(AlmondMilk) 그리고 두리안 스무디(DurianSmoothie)가 그 구성자들입니다.

source: This type has four constructors: water, limeade, almondMilk, and durianSmoothie.
ko: 이 유형에는 구성자가 네 개 있습니다. 물(water), 라이메이드(limeade), 아몬드 우유(almondMilk) 그리고 두리안 스무디(durianSmoothie)가 그 구성자들입니다.

source: Virtual CYSEM is CYSEM. (Depiction.isCYSEM_of_isVirtualCYSEM)
ko: 가상 아동·청소년 성 착취물은 아동·청소년 성 착취물이다. (Depiction.isCYSEM_of_isVirtualCYSEM)

source: Virtual CYSEM lacks any value.
ko: 가상 아동·청소년 성 착취물은 하등의 가치를 지니지 않는다.

source: Virtual CYSEM, which only uses adults or fictional characters, is by definition obscene.
ko: 성인이나 가상의 캐릭터만 이용해 만든 가상 아동·청소년 성 착취물은 정의상(定義上) 음란하다.

source: Water has no smell; the rest have it.
ko: 물은 냄새가 안 나고, 나머지는 냄새가 난다.

source: We can define an instance of GoodSmellingDrink BulhwiDrink as follows:
ko: GoodSmellingDrink BulhwiDrink의 사례는 다음과 같이 정의할 수 있습니다.

source: We shouldn't allow propositions of the form "d smells good," where d is a constant representing a drink that has no smell.
ko: 'd는 냄새가 좋다.' 꼴의 명제를 d가 냄새가 안 나는 음료를 나타내는

source: We shouldn't allow propositions of the form "d smells good," where d is a constant that refers to a drink having no smell.
ko: 'd는 냄새가 좋다.' 꼴의 명제를 허용하지 d가 냄새가 안 나는 음료를 나타내는

source: We shouldn't allow using statements of the form "d smells good," where d is a constant that refers to a drink having no smell.
ko: d가 냄새가 안 나는 음료를 나타내는 상수일 때, 'd는 냄새가 좋다.' 꼴의 진술을 이용하지 못하게 해야 합니다.

source: You are free to reuse the content under the terms of the Apache License, Version 2.0.
ko: 아파치 라이선스, 버전 2.0의 조건에 따라 이 저작물을 재이용할 수 있습니다.

source: You can see my discussion with them in this link.
ko: 이분들과의 논의는 이 링크에서 볼 수 있습니다.

source: You need to install the Okapi filters plugin for OmegaT to make OmegaT parse Markdown files.
ko: 오메가T로 마크다운 파일을 구문 분석 하려면 오메가T를 위한 오카피(Okapi) 필터 플러그인을 설치해야 됩니다.

source: \(a\) Sexual intercourse; \(b\) Pseudo-sexual intercourse using part of the body, such as the mouth and anus, or implements; \(c\) Contacting or exposing all or part of the body, which causes sexual humiliation or repugnance of ordinary people; \(d\) Masturbation;
ko: 가. 성교 행위 \ 나. 구강·항문 등 신체의 일부나 도구를 이용한 유사 성교 행위 \ 다. 신체의 전부 또는 일부를 접촉·노출하는 행위로서 일반인의 성적 수치심이나 혐오감을 일으키는 행위 \ 라. 자위 행위
